## Introduction

`pandas` is a library for Python that provides fast, flexible, and expressive data structures designed to work with relational or tabular data, such as an SQL table, or an Excel spreadsheet. It is a fundamental, high-level building block for doing practical, real-world data analysis with Python.

We use the following importing convention to import the `pandas` library:

`import pandas as pd`

`pandas` is well-suited to the following cases:

- When you have tabular data with heterogeneously typed columns
- When you have ordered or unordered time series data
- When you have data that is in rows and columns, similar to a matrix

There are two primary data structures in `pandas`:

- Series – a one-dimensional data structure
- DataFrame – a two-dimensional data structure

They can handle the vast majority of cases for data analysis that you find in different fields, such as finance, statistics, social science, and many areas of engineering and business as well.

`pandas` is built on top of `NumPy` and it is intended to integrate well within a scientific computing environment with many other third-party libraries.

## I. Series and DataFrames

The two most important objects in `pandas` are **series** and **DataFrames**. To start, let’s import `pandas`, as well as `NumPy`:

In [1]:
%autosave 5

Autosaving every 5 seconds

In [2]:
# Import libraries
import pandas as pd
import numpy as np

### Series

The series data structure in `pandas` is a one-dimensional labeled array. Data in a series:

- Can be of any type e.g. integers, strings, floating-point numbers, Python objects, etc.
- Is homogeneous in nature – i.e. all the data must be of the same type
- Always has an index

![pandas](pandas1.png)

The preceding diagram is a visual example of a `pandas` series. You can see that every data point is associated with an index.

#### Creating a pandas series

There are many ways to create `pandas` series. The following are some of the most common ways:

- Creation from a list
- Creation from a dictionary
- Creation from a `NumPy` array

Let’s first learn how to create a series from a list. We will create a list of values and name it `temperature`, and another list of values named `days`. To create a series from these two lists, all you have to do is use the `pd.Series()` constructor:

In [3]:
# Define lists
temperature = [33, 19, 15, 89, 11, -5, 9]
days = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun']

# Create series
pd.Series(data=temperature, index=days)

Mon    33
Tue    19
Wed    15
Thu    89
Fri    11
Sat    -5
Sun     9
dtype: int64

We specified that the index should take the values from `days`. If we did not provide this, the index will default to `0, 1, …, n` where n is the index of the last element of the list.

Next, we will create a series from a Python dictionary. When you create a `pandas` series from a dictionary, all the keys will be used as the indices, and the respective values will be the values in the series.

Let’s define our dictionary, `my_dict`, then pass the dictionary to `thepd.Series()` constructor.

In [4]:
# Define dictionary
my_dict = {
    'Mon': 33,
    'Tue': 19,
    'Wed': 15,
    'Thu': 89,
    'Fri': 11,
    'Sat': -5,
    'Sun': 9
}

# Create series
pd.Series(data=my_dict)

Mon    33
Tue    19
Wed    15
Thu    89
Fri    11
Sat    -5
Sun     9
dtype: int64

Now, let’s look at how to create a `pandas` series from a `NumPy` array. First, let's define an object, `my_array`, using the `np.linspace` function. Then, again, pass this into `pd.Series`:

In [5]:
# Define array
my_array = np.linspace(0, 10, 15)

# Create series
pd.Series(data=my_array)

0      0.000000
1      0.714286
2      1.428571
3      2.142857
4      2.857143
5      3.571429
6      4.285714
7      5.000000
8      5.714286
9      6.428571
10     7.142857
11     7.857143
12     8.571429
13     9.285714
14    10.000000
dtype: float64

You can also do vectorized operations with `pandas` series, similar to how you can with `NumPy` arrays. If you do one operation on a series, the same operation will be applied to every element in the series.

Let’s give it a go! Using `my_series`, a series created using the `np.arange()` function, try to perform some vectorized operations!

Add 1 to each value of `my_series`. Assign this to a new series called `my_series_add` and print the new series.

In [6]:
# TASK --- Using this series...
my_series = pd.Series(np.arange(0, 20, 2))
print(my_series)

# -------- Add 1 to each value
my_series_add = my_series + 1
print(my_series_add)

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int64
0     1
1     3
2     5
3     7
4     9
5    11
6    13
7    15
8    17
9    19
dtype: int64

Multiply each value of `my_series` by 2. Assign this to a new series called `my_series_multiply` and print the new series.

In [7]:
# TASK --- Using this series...
my_series = pd.Series(np.arange(0, 20, 2))

# -------- Multiply each value by 2
my_series_multiply = my_series * 2
print(my_series_multiply)

0     0
1     4
2     8
3    12
4    16
5    20
6    24
7    28
8    32
9    36
dtype: int64

Calculate the exponential of each value of `my_series`. Assign this to a new series called `my_series_exp` and print the new series.

In [8]:
# TASK --- Using this series...
my_series = pd.Series(np.arange(0, 20, 2))

# -------- Calculate the exponential of each value
my_series_exp = np.exp(my_series)
print(my_series_exp)

0    1.000000e+00
1    7.389056e+00
2    5.459815e+01
3    4.034288e+02
4    2.980958e+03
5    2.202647e+04
6    1.627548e+05
7    1.202604e+06
8    8.886111e+06
9    6.565997e+07
dtype: float64

### DataFrames

A `DataFrame` is a two-dimensional labeled data structure with columns of potentially different types. A `pandas` DataFrame is similar to a Microsoft Excel spreadsheet, or a SQL table. You have two indices, the index for the rows and the index for the columns:

![pandas2](pandas2.png)

In the preceding diagram, we have two indices, columns associated with values of `Dates`, `Tokyo`, and so on, and a row associated with INDEX.

Note that each individual column in a DataFrame is itself a series.

#### Creating a pandas DataFrame

There are also many ways to create pandas DataFrames. You can create DataFrames from the following:

- Lists
- Dictionaries
- Arrays
- Series

Since these methods are very similar to creating series, we will not go through these – all you have to do is replace the `pd.Series()` constructor with the `pd.DataFrame()` or `pd.DataFrame.from_dict()` constructors.

Instead, we will discuss another extremely common method… creating DataFrames from external files such as `.txt` files, `.csv` files, Excel files, or databases!

Let's create a DataFrame from a real-world dataset. The dataset that we will use is one that contains data about human resources, employee attrition, performance, and so on. You can find out more here.

We have already uploaded the `.csv` file for you – all we have to do is import it using `pd.read_csv()`:

In [3]:
# Read csv file as DataFrame
data = pd.read_csv("HR-Employee-Attrition.csv", index_col='EmployeeNumber')

In the above snippet, we created a DataFrame called data and used the column `EmployeeNumber` as the index.

If the file had been an Excel file, we would have used `pd.read_excel()`. Here is a list of all the file types that pandas can read.

Now that we have a DataFrame, let’s take a look at it’s anatomy. A DataFrame consists of three parts:

- An index
- The column names
- The data

The row and column labels can be accessed respectively by accessing the index and columns attributes

In [6]:
# Access index of DataFrame
data.index

Int64Index([   1,    2,    4,    5,    7,    8,   10,   11,   12,   13,
            ...
            2054, 2055, 2056, 2057, 2060, 2061, 2062, 2064, 2065, 2068],
           dtype='int64', name='EmployeeNumber', length=1470)

In [11]:
# Access columns of DataFrame
data.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobLevel', 'JobRole', 'JobSatisfaction', 'MaritalStatus',
       'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked', 'Over18',
       'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

The values attribute will give the values of the DataFrame, which will always be in the form of a `NumPy` array.

In [12]:
# Access values of DataFrame
data.values

array([[41, 'Yes', 'Travel_Rarely', ..., 4, 0, 5],
       [49, 'No', 'Travel_Frequently', ..., 7, 1, 7],
       [37, 'Yes', 'Travel_Rarely', ..., 0, 0, 0],
       ...,
       [27, 'No', 'Travel_Rarely', ..., 2, 0, 3],
       [49, 'No', 'Travel_Frequently', ..., 6, 0, 8],
       [34, 'No', 'Travel_Rarely', ..., 3, 1, 2]], dtype=object)

Now that we've created a DataFrame, let's continue on to take a look at the data!

## II. Operations and manipulations

There are a number of operation methods used to work in `pandas`. In this step, we will look into some of the common operations.

### Inspection of data

The first thing that you will want to do when loading a DataFrame or creating a DataFrame from a file is to inspect the data that you just loaded. We have two methods for inspecting the data:

- `.head()` – shows the first five rows of data
- `.tail()` – shows the last five rows of data

In [ ]:
# Access first five rows of DataFrame
data.head()

In [ ]:
# Access last five rows of DataFrame
data.tail()

As you can see from the output, the first and last five rows, and 34 columns are displayed. It is always a good practice to use these two methods to make sure that the data is correctly loaded – e.g. to check whether there are header or totals rows you need to remove, whether all rows and columns of your data were imported, etc.

### Selection, addition, and deletion of data

Getting, setting, and deleting columns works with the same syntax as working with dictionaries. Let's look at a few examples. Suppose you want to access certain columns in your DataFrame. All you have to do is indicate the name of the column(s) you want to access:

In [13]:
# Selecting one column
data['Age'].head()

EmployeeNumber
1    41
2    49
4    37
5    33
7    27
Name: Age, dtype: int64

In [14]:
# Selecting multiple columns
data[['Age', 'Gender', 'YearsAtCompany']].head()

                Age  Gender  YearsAtCompany
EmployeeNumber
1                41  Female               6
2                49    Male              10
4                37    Male               0
5                33  Female               8
7                27    Male               2

Note that `.head()` is used to avoid displaying all the rows in the DataFrame, which would be too long to list.

Say you wanted to add a column to the DataFrame that stored an employee’s age in months (i.e. age multiplied by 12). You could do the following:

In [15]:
# Add column to DataFrame
data['AgeInMonths'] = data['Age'] * 12
data['AgeInMonths'].head()

EmployeeNumber
1    492
2    588
4    444
5    396
7    324
Name: AgeInMonths, dtype: int64

This snippet added a column called `AgeInMonths` to our DataFrame data, and inserted the values `Age * 12` to the column.

To delete a row or column from a DataFrame, you use the drop method, and pass the rows(s) or column(s) that you want to delete. If you are deleting rows, you should specify that this will be from axis=0. If you are deleting columns, you should specify axis=1. The default is to delete rows.

In [16]:
# Drop column from DataFrame
data.drop('AgeInMonths', axis=1, inplace=True)

The above snippet dropped the columns we just created. The argument `inplace` specifies whether you want to modify the data object in place i.e. whether you want this change to be permanent in the data structure.

Drop the column called `EmployeeCount.`

In [17]:
# TASK --- Drop `EmployeeCount`
data.drop('EmployeeCount', axis = 1, inplace = True)

### Slicing DataFrames

Just as you can do with `NumPy` series, you can take slices from both `pandas` series and DataFrames. We use the same notation:

In [18]:
# Slicing a series
data['BusinessTravel'][10:15]

EmployeeNumber
14    Travel_Rarely
15    Travel_Rarely
16    Travel_Rarely
18    Travel_Rarely
19    Travel_Rarely
Name: BusinessTravel, dtype: object

When slicing `pandas` objects, as with `NumPy` arrays, the sliced data excludes the stop index. Now you try!

In [19]:
# Slicing a DataFrame
data[10:15]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
14,35,No,Travel_Rarely,809,Research & Development,16,3,Medical,1,Male,...,3,80,1,6,5,3,5,4,0,3
15,29,No,Travel_Rarely,153,Research & Development,15,2,Life Sciences,4,Female,...,4,80,0,10,3,3,9,5,0,8
16,31,No,Travel_Rarely,670,Research & Development,26,1,Life Sciences,1,Male,...,4,80,1,5,1,2,5,2,4,3
18,34,No,Travel_Rarely,1346,Research & Development,19,2,Medical,2,Male,...,3,80,1,3,2,3,2,2,1,2
19,28,Yes,Travel_Rarely,103,Research & Development,24,3,Life Sciences,3,Male,...,2,80,0,6,4,3,4,2,0,3

Access the fifth to eighth rows of the `Department` and `EducationField` columns in the DataFrame. Remember that indexing begins with zero.

In [20]:
# TASK --- Access the 5th to 8th rows of `Department` and `EducationField`
data[['Department','EducationField']][4:8]

                            Department EducationField
EmployeeNumber
7               Research & Development        Medical
8               Research & Development  Life Sciences
10              Research & Development        Medical
11              Research & Development  Life Sciences

If you look carefully at this output, you may see a potential source of confusion in using this method of slicing…We accessed the 5th to 8th rows…but the index values (`EmployeeNumber`) are not 4, 5, 6, and 7! Luckily `pandas` provides us with explicit index slicing methods, `loc` and `iloc`.

#### Slicing by labels

Say you want employee data for specific employees, and you know what their `EmployeeNumbers` are. You can get this data by using the `loc` method.

Let's use these employee numbers as labels to access the data that we want.

In [21]:
# Slicing using `loc`
data.loc[[15, 94, 337, 1120]]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
15,29,No,Travel_Rarely,153,Research & Development,15,2,Life Sciences,4,Female,...,4,80,0,10,3,3,9,5,0,8
94,29,No,Travel_Rarely,1328,Research & Development,2,3,Life Sciences,3,Male,...,4,80,1,6,3,3,5,4,0,4
337,31,No,Travel_Frequently,1327,Research & Development,3,4,Medical,2,Male,...,1,80,1,9,3,3,2,2,2,2
1120,29,No,Travel_Rarely,1107,Research & Development,28,4,Life Sciences,3,Female,...,1,80,1,11,1,3,7,5,1,7

This gives us data for employees with employee numbers 15, 94, 337, and 1120… not for those in rows 15, 94, 337, and 1120.

#### Slicing by position

If we want employee data for specific employees, and we know what their position in the DataFrame are, we can access data using the `iloc` method.

In [22]:
# Slicing using `iloc`
data.iloc[0:5]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
1,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,2,Female,...,1,80,0,8,0,1,6,4,0,5
2,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,3,Male,...,4,80,1,10,3,3,10,7,1,7
4,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,4,Male,...,2,80,0,7,3,3,0,0,0,0
5,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,4,Female,...,3,80,0,8,3,3,8,7,3,0
7,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,Male,...,4,80,1,6,3,3,2,2,2,2

This gives us data for employees in the first five rows of the DataFrame – this is the same as normal indexing: data[0:5].

## III. Answering questions

Now that we’ve explored our data a bit, it’s time for use our data to answer some questions! Say the HR director asks the following questions about the employees of the company:

- How many employees are there by department?
- What is the overall attrition rate?
- What is the average hourly rate?
- What is the average number of years at the company?
- Who are the five employees with the most number of years at the company?
- How satisfied are employees overall?

Let’s see if we can answer these using our data!

#### Total employees by department
As you learned in the previous step, to view the departments in the dataset, you use the `data['Department']` statement. To count the number of times each unique value from Department appears in your dataset, you use the `value_counts()` method:

In [23]:
# Total employees by department
data['Department'].value_counts()

Research & Development    961
Sales                     446
Human Resources            63
Name: Department, dtype: int64

Great! We can report back to the HR director that there are 961 employees in R&D, 446 in Sales, and 63 in HR.

#### Overall attrition rate

The Attrition column is binary. No means that the employee is still with the company, Yes means the employee has left.

Similar to before, we can compute the occurrence of each unique value by passing the value_counts method. To get the attrition rate, which is the proportion of employees that have left the company, we use the additional argument, `normalize=True`.

In [24]:
# Overall attrition rate
normalized_count = data['Attrition'].value_counts(normalize=True)
normalized_count

No     0.838776
Yes    0.161224
Name: Attrition, dtype: float64

This gives the percentage of `No`s and `Yes`s. To get just the attrition rate (only the `Yes`s), we use the associated label:

In [25]:
normalized_count['Yes']

0.16122448979591836

We have an attrition rate of 16.12%…not too bad!

#### Average hourly rate

There are a lot of statistical methods that you can use in `pandas` series. One of the statistical methods that you will use often is the `mean` method, which computes the mean of your `pandas` series:

In [26]:
# Average hourly rate
data['HourlyRate'].mean()

65.89115646258503

Using this method, we find that the mean for the `HourlyRate` variable is 65.89.

#### Average number of years

To get the average number of years at the company, you can use the mean method again. However, there is another very useful method by which you get not only the mean, but also many other descriptive statistics of the series. This method is known as the `describe()` method.

In [27]:
# Average number of years
data['YearsAtCompany'].describe()

count    1470.000000
mean        7.008163
std         6.126525
min         0.000000
25%         3.000000
50%         5.000000
75%         9.000000
max        40.000000
Name: YearsAtCompany, dtype: float64

This returns the mean as 7 years, as well as the standard deviation, the minimum, the maximum, and the percentiles. This handy method can also be used on the entire DataFrame!

#### Employees with the most number of years

The `sort_values` method will sort the values of a series in ascending order by default. If you don't want them in ascending order, you can specify this argument to be `False`. As always, it will display the whole list of data, so we have used the slicenotation to get the first five elements in the `Series`:

In [28]:
# Employees with the most number of years
data['YearsAtCompany'].sort_values(ascending=False)[:5]

EmployeeNumber
165     40
131     37
374     36
1578    36
776     34
Name: YearsAtCompany, dtype: int64

Wow, employee number 165 has been with the company for 40 years!

#### Overall employee satisfaction

The column `JobSatisfaction` stores each employees’ satisfaction ratings ranging from 1 (low) to 4 (very high). We don’t want to report numbers to the HR director though.. rather, we want to report what each number means.

Let’s create a dictionary to store what each number corresponds to.

In [29]:
# Overall employee satisfaction
job_satisfaction_dict = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

Now we map the values in our pandas series `data['JobSatisfaction']` to their respective meanings using `map()` – that is, 1 will be transformed into `Low`, 2 to `Medium`, and so on. Then, we reassign the original series with the new mapped series.

In [30]:
data['JobSatisfaction'] = data['JobSatisfaction'].map(job_satisfaction_dict)
data['JobSatisfaction'].head()

EmployeeNumber
1    Very High
2       Medium
4         High
5         High
7       Medium
Name: JobSatisfaction, dtype: object

As you can see in the output, we have replaced the numerical values 1 to 4 with their English meanings.

Finally, we need to get the normalized count –

In [31]:
data['JobSatisfaction'].value_counts(normalize=True)

Very High    0.312245
High         0.300680
Low          0.196599
Medium       0.190476
Name: JobSatisfaction, dtype: float64

Excellent, 31% of employees have Very High job satisfaction!

Now, try to answer some questions on your own!

Find the total number of employees in each education field (`EducationField` column).

In [32]:
# TASK --- Employees per education field
data['EducationField'].value_counts()

Life Sciences       606
Medical             464
Marketing           159
Technical Degree    132
Other                82
Human Resources      27
Name: EducationField, dtype: int64

Find the count of employees per performance rating (`PerformanceRating` column). Map the values to their respective meanings (`1: 'Low', 2: 'Good', 3: 'Excellent', 4: 'Outstanding'`).

In [33]:
# TASK ---  Employees per performance rating
performance_rating_dict = {
    1 : 'Low',
    2 : 'Good',
    3 : 'Excellent',
    4 : 'Outstanding',
}

data['PerformanceRating'] = data['PerformanceRating'].map(performance_rating_dict)
data['PerformanceRating'].value_counts()

Excellent      1244
Outstanding     226
Name: PerformanceRating, dtype: int64

## IV. Answering complex questions

The HR director is happy with your responses to the first round of questions… but now wants to know a little more about the employees. The following are the new tasks assigned to you:

- List the employees who have a Low level of `JobSatisfaction`
- List the employees who have a Low level of both `JobSatisfaction` and `JobInvolvement`
- Compare the employees with `Low` and `Very High` `JobSatisfaction` across the following variables: `Age`, `Department`, and `DistanceFromHome`

#### Employees with Low Job Satisfaction

To answer this question, we use a boolean series to index a series or a DataFrame. This is called masking, or boolean indexing. First, we use the comparison operator == to compare the pandas series (the `Jobsatisfaction` column of our DataFrame) with a value (`‘Low’`), as follows:

In [34]:
# Employees with Low Job Satisfaction
data['JobSatisfaction'] == 'Low'

EmployeeNumber
1       False
2       False
4       False
5       False
7       False
8       False
10       True
11      False
12      False
13      False
14      False
15      False
16      False
18      False
19      False
20       True
21      False
22      False
23      False
24      False
26      False
27       True
28      False
30      False
31       True
32      False
33       True
35      False
36      False
38       True
        ...
2025    False
2026    False
2027    False
2031    False
2032    False
2034    False
2035    False
2036    False
2037    False
2038     True
2040    False
2041    False
2044    False
2045    False
2046    False
2048    False
2049    False
2051    False
2052    False
2053    False
2054     True
2055     True
2056    False
2057     True
2060    False
2061    False
2062     True
2064    False
2065    False
2068    False
Name: JobSatisfaction, Length: 1470, dtype: bool

This will return a boolean series with the values `True` or `False` for each employee. True is where the value of `JobSatisfaction` for an employee is equal to `Low` and `False` is when the values are not equal to Low.

You can use this boolean series to index another object to get back a new series or DataFrame with the observations where you have `True` values.

In [35]:
data.loc[data['JobSatisfaction'] == 'Low'].index

Int64Index([  10,   20,   27,   31,   33,   38,   51,   52,   54,   68,
            ...
            1975, 1980, 1998, 2021, 2023, 2038, 2054, 2055, 2057, 2062],
           dtype='int64', name='EmployeeNumber', length=289)

Let’s break this down – we used the boolean series `data['JobSatisfaction'] == 'Low’` to index our DataFrame data using the `loc` method. This by itself gives us data in all columns for employees with low `JobSatisfaction`. However, we only want the employee number. So by calling the index attribute, we return a list of employees with low `JobSatisfaction`.

#### Employees with both Low Job Satisfaction and Job Involvement
The JobInvolvement column has the same properties as the JobSatisfaction column, so instead of the categories, we have the corresponding numbers. We will first apply the map transformations that we applied previously to the JobSatisfaction column

In [36]:
# Employees with both Low Job Satisfaction and Job Involvement
job_involvement_dict = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

data['JobInvolvement'] = data['JobInvolvement'].map(job_involvement_dict)

We can use an & logical operator to run the operation on two boolean series to get the list of employees with low `JobSatisfaction` and low `JobInvolvement`. Again, we will use the loc selection method and the index attribute to get the specific requirements:

In [37]:
data.loc[(data['JobSatisfaction'] == 'Low') & (data['JobInvolvement'] == 'Low')].index

Int64Index([33, 235, 454, 615, 1019, 1037, 1237, 1460, 1478, 1544, 1611, 1622,
            1905, 1956],
           dtype='int64', name='EmployeeNumber')

Great, you can now report back with this list of 14 employees with low job satisfaction and low job involvement!

#### Employee comparison

Now we will compare the employees with Low and Very High `JobSatisfaction` levels. We will compare these two groups across the following variables: `Age`, `Department`, and `DistanceFromHome`.

First, let’s create a new DataFrame that contains only those observations that we are interested in – those with Low or Very High `JobSatisfaction`.

In [38]:
# Employee comparison
## Create new DataFrame with observations of interest
subset = data.loc[(data['JobSatisfaction'] == 'Low') | (data['JobSatisfaction'] == 'Very High')]
print('Shape: ', subset.shape)
print('\nJob Satisfaction Count')
print(subset['JobSatisfaction'].value_counts())

Shape:  (748, 33)

Job Satisfaction Count
Very High    459
Low          289
Name: JobSatisfaction, dtype: int64

The above snippet created a new DataFrame subset using the `|` (`“or”`) operator. We can see that there are 748 observations in this new DataFrame, with 459 employees having very high job satisfaction and 289 having low job satisfaction.

Now that we’ve narrowed down to the necessary observations, we can apply a `groupby` operation. `Groupby` applies a sequence of actions – split, apply, and combine.

Split the DataFrame into a group of DataFrames across any axis based on some criteria. This produces a `GroupBy` object that has a structure similar to a dictionary, where every group is associated with a different key.

Apply a function (e.g. mean, sum, count) to groups in this `GroupBy` object.

Combine the results of the function into a new data structure.

Let’s give it a try!

In [39]:
## Split DataFrame by 'JobSatisfaction'
grouped = subset.groupby('JobSatisfaction')

## View groups in GroupBy object
grouped.groups

{'Low': Int64Index([  10,   20,   27,   31,   33,   38,   51,   52,   54,   68,
             ...
             1975, 1980, 1998, 2021, 2023, 2038, 2054, 2055, 2057, 2062],
            dtype='int64', name='EmployeeNumber', length=289),
 'Very High': Int64Index([   1,    8,   18,   22,   23,   24,   30,   36,   39,   40,
             ...
             2022, 2024, 2027, 2036, 2040, 2041, 2045, 2052, 2056, 2061],
            dtype='int64', name='EmployeeNumber', length=459)}

Using `groupby` to split our `subset` DataFrame by `JobSatisfaction`, we have created a `GroupBy` object called grouped. By applying the groups method to this newly created object, we see that we have two groups – Low and Very High (since these are the two possible values of `JobSatisfaction`).

If you want to actually get the data associated with every group, you can use the get_group method. For example, if you use the get_group method with the Low key, you will get the DataFrame associated with the Low group.

In [40]:
## View details of Low group
grouped.get_group('Low').head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EnvironmentSatisfaction,Gender,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
EmployeeNumber,,,,,,,,,,,,,,,,,,,,,
10,59,No,Travel_Rarely,1324,Research & Development,3,3,Medical,3,Female,...,1,80,3,12,3,2,1,0,0,0
20,29,No,Travel_Rarely,1389,Research & Development,21,4,Life Sciences,2,Female,...,3,80,1,10,1,3,10,9,8,8
27,36,Yes,Travel_Rarely,1218,Sales,9,4,Life Sciences,3,Male,...,2,80,0,10,4,3,5,3,0,3
31,34,Yes,Travel_Rarely,699,Research & Development,6,1,Medical,2,Male,...,3,80,0,8,2,3,4,2,1,3
33,32,Yes,Travel_Frequently,1125,Research & Development,16,1,Life Sciences,2,Female,...,2,80,0,10,5,3,10,2,6,7

Now, we can apply a function to each group in our new object. To compare `Age`, let’s apply the describe method to get summary statistics for each group –

In [41]:
## Get summary statistics for age for each group
grouped['Age'].describe()

                 count       mean       std   min   25%   50%   75%   max
JobSatisfaction
Low              289.0  36.916955  9.245496  19.0  30.0  36.0  42.0  60.0
Very High        459.0  36.795207  9.125609  18.0  30.0  35.0  43.0  60.0

This gives us the mean, max, min, etc. for the age of employees in each group!

Next, to compare department distribution for each group, we can use the `value_counts` method and the `normalize` operation to get percentages. We will also multiply values by 100 to format the values as percentages.

In [42]:
## Get employee count per department for each group
grouped['Department'].value_counts(normalize=True) * 100

JobSatisfaction  Department
Low              Research & Development    66.435986
                 Sales                     29.757785
                 Human Resources            3.806228
Very High        Research & Development    64.270153
                 Sales                     32.026144
                 Human Resources            3.703704
Name: Department, dtype: float64

This returns a series with a multi-level index – the first level index is the group Low or Very High, the second level index is the department. We can unstack this to create a single index DataFrame –

In [43]:
grouped['Department'].value_counts(normalize=True).unstack() * 100

Department       Human Resources  Research & Development      Sales
JobSatisfaction
Low                     3.806228               66.435986  29.757785
Very High               3.703704               64.270153  32.026144

Great, now we can see that for employees with low job satisfaction, 3.8% are in HR, 66.4% are in R&D, and 29.8% are in `Sales`… and for employees with high job satisfaction, these percentages are 3.7%, 64.3%, and 32%.

Finally, for the `DistanceFromHome` comparison, let’s get the mean for each group. See if you can do this on your own!

Find the mean distance from home for employees with Low and Very High `JobSatisfaction`.

In [44]:
# TASK --- Get mean distance from home for each group
grouped['DistanceFromHome'].mean()

JobSatisfaction
Low          9.190311
Very High    9.030501
Name: DistanceFromHome, dtype: float64